{
  "mainPage": {
    "welcome": "Добро пожаловать",
    "welcome_back": "Добро пожаловать обратно",
    "sign_in": "Войти",
    "sign_up": "Зарегистрироваться",
    "sign_out": "Выйти",
    "history": "История",
    "rest_client": "REST Клиент",
    "graph_client": "GraphiQL Клиент",
    "project": "Проект",
    "project_text1": "Этот проект представляет собой облегченный API-клиент, объединяющий возможности Postman и GraphQL. Он позволяет пользователям делать запросы REST и GraphQL, управлять историей запросов и поддерживает аутентификацию и авторизацию с помощью Firebase. Приложение разработано с использованием React и Remix и призвано предложить интуитивно понятный интерфейс для тестирования API.",
    "project_text2": "Это учебное финальное задание на курсу React 2024 Q3 в RSSchool, Задание расчитано на команду из 3 человек.",
    "project_feature1_title": "REST Клиент",
    "project_feature1_text": "Поддерживает создание запросов RESTful API с выбором метода, вводом URL и заголовками.",
    "project_feature2_title": "GraphQL Песочница",
    "project_feature2_text": "Предоставляет интерфейс для построения и выполнения запросов GraphQL.",
    "project_feature3_title": "Авторизация и Аутентификация",
    "project_feature3_text": "Аутентификация пользователей осуществляется через Firebase, что гарантирует доступ только авторизованным пользователям.",
    "project_feature4_title": "История Запросов",
    "project_feature4_text": "Отслеживает ранее выполненные запросы и позволяет пользователям повторно к ним возвращаться.",
    "course": "Курс",
    "course_text1": "RS School — это бесплатная программа, основанная на сообществе онлайн-образовательных программ, которую проводит сообщество The Rolling Scopes с 2013 года.",
    "course_text2": "Учащиеся RS School, завершившие RS School этап 2, а также новые студенты с хорошими навыками этапов CoreJS/TS/Frontend могут перейти на React Course.",
    "course_text3": "На курсе проходятся базовые темы для понимания технологии, а также дополнительные темы по рендерингу на стороне сервера. На каждую тему отводится примерно одна неделя, в течении которой выполняется связанное с теорией практическое задание. В заданиях предусмотрено не только использование React, а также другие технологии из мира IT, что позволяет расширить познания в программировании в целом.",
    "course_text4": "Курс по реакту хорош и тем, что здесь не оставляют тебя одного со своим вопросом, его всегда можно задать в сообщесте студентов и тренеров. Также на курсе предусмотрена менторсная помощь и проверка практического задания.",

    "developers": "Разработчики",
    "developer1_name": "Виталий Шелепков",
    "developer1_text": "Совершенно секретно. Личное дело AV-Shell. Характеристика на участника RS-school с 2020 года, студента RS-School, активиста, ментора: Истинный Белорус. Характер - славянский, выдержанный. С друзьями и коллегами по работе открыт, дружелюбен. Беспощаден на кроссчеках. Отличный семьянин. Связей, порочащих его, не имел. В работе проявил себя выдающимся компанейским человеком.",
    "developer2_name": "Елена Якимович",
    "developer2_text": "Пришла в RS-school в 2020 году, время от времени проходит разные курсы. Была студентом почти на всех курсах и ментором на курсах про фронт-энду. До школы никак не была связана с программированием. Любит красить кнопки и бэк энд, не может выбрать что-то одно.",
    "developer3_name": "Вячеслав Невзоров",
    "developer3_text": "Меня зовут Невзоров Вячеслав, мне 20 лет. Я живу в Гомеле, учусь в Гомельском государственном университете имени Франциска Скорины. Мне не нравится Frontend, я никогда его не любил и не стремлюсь им стать, меня привели сюда обстоятельства. Мне больше импонирует backend-разработка, поэтому я активно изучаю платформу .NET.",
    "more_info": "Подробнее"
  },
  "headersSelector": {
    "titleText": "Заголовки",
    "headerNameInputPlaceholder": "имя заголовка",
    "headerValueInputPlaceholder": "значение заголовка"
  },
  "restVariablesSelector": {
    "titleText": "Переменные",
    "variableNameInputPlaceholder": "имя переменной",
    "variableValueInputPlaceholder": "значение переменной"
  },
  "restPage": {
    "bodyEditorPlaceholder": "введите тело запроса",
    "requestButton": "Отправить запрос",
    "prettifyButton": "Форматировать",
    "bodyFormatError": "Ошибка форматирования:"
  },
  "restPage_example": {
    "submitButton_example": "Отправить",
    "resetButton_example": "Сбросить",
    "setButton_example": "Установить"
  }
}
